import React from 'react'

const Instructions = () => {
  return (
    <>
    <>
    <div className="px-4 py-5 text-center" id="inst">
  <h1
    className="display-4 fw-bold pt-5 text-light"
    style={{ textShadow: "0 1px 0 black, 0 2px 0 black" }}
  >
    الإرشادات
  </h1>
  <div className="col-lg-6 mx-auto">
    <p className="lead mb-4 ">
      يجب قراءة هذه الإرشادات جيدا لكتابة خطة الدرس بشكل صحيح و دقيق.
    </p>
    <div className="d-grid gap-2 d-sm-flex justify-content-sm-center mb-5">
      <a href="#ins" type="button" className="btn btn-dark btn-lg px-4 me-sm-3">
        الأنتقال
      </a>
    </div>
  </div>
</div>

  <span id="ins" />
  <div className="container-fluid p-4 p-md-5" id="instructionsSection">
    <div className="row">
      <div className="col-md-6 px-0" id="instructions">
        <p className="lead my-5">أخي المعلم -- أختي المعلمة</p>
        <p className="lead mb-0">
          أولاً : عند إعدادك لخطة الدرس يمكنك الاسترشاد بما يأتي :
        </p>
        <ul className="my-3">
          <li>1- قراءة الدرس جيداً وتحليل محتواه.</li>
          <li>2- الرجوع إلى دليل المعلم.</li>
          <li>
            3- التأكد من توافر المواد والأدوات والتجهيزات اللازمة لتحقيق نتاجات
            الدرس وفق الإمكانات المتاحة.
          </li>
        </ul>
        <p />
        <p className="lead mb-0">ثانياً : تعبئة نموذج خطة الدرس</p>
        <p className="my-3">أ‌. تعبئة الترويسة كالآتي :</p>
        <ul>
          <li>
            - الصف / المستوى : يقصد بالصف من ( 1 – 10) الأساسي ، أما المستوى فهو
            للمرحلة الثانوية للمستويـات ( م1 ، م2 ، م3 ، م4 ).
          </li>
          <li>- المبحث : اسم المبحث الذي يدرسه المعلم.</li>
          <li>- عنوان الوحدة : اسم الوحدة.</li>
          <li>- عنوان الدرس : اسم الدرس.</li>
          <li>- عدد الحصص : عدد الحصص المطلوبة لتنفيذ الدرس.</li>
          <li>
            - التاريخ من : التاريخ المتوقع لبدء تنفيذ الدرس إلى / التاريخ
            المتوقع لإنهاء الدرس.
          </li>
          <li>
            - التعلم القبلي : المتطلبات اللازمة للتعلم الجديد ، مثل ( المفاهيم
            والمهارات والحقائق والقوانين و ... الخ ).
          </li>
          <li>
            - التكامل الرأسي : تحديد مواطن التكامل ضمن المبحث الواحد من الصفوف
            السابقة أو اللاحقة مبيناً : ( عنوان الموضوع والكتاب والوحدة و .. ).
          </li>
          <li>
            - التكامل الأفقي : تحديد مواطن التكامل مع دروس المبحث نفسه أو
            المباحث الأخرى في نفس الصف مبيناً : ( اسم المبحث والكتاب والوحدة و
            .. ).
          </li>
          <li>- صفحة " " : لوضع رقم الصفحة. </li>
        </ul>
        <p />
        <p className="my-3">ب. تعبئة عناصر الخطة :</p>
        <ul>
          <li>- الرقم : رقم النتاج ( 1 ، 2 .. ).</li>
          <li>
            - النتاجات الخاصة : المعارف والمهارات والاتجاهات المتوقع تحقيقها في
            نهاية الدرس.
          </li>
          <li>
            - المواد والأدوات والتجهيزات ( مصادر التعلم ) : كل ما يلزم لتحقيق
            النتاج، مثل : ( وسائل تعليمية وتكنولوجية ،وكتب ونماذج ، وعينات ،
            وأفلام ، و .. ).
          </li>
          <li>
            - استراتيجيات التدريس : كتابة رقم استراتيجية التدريس الواردة في صفحة
            ( جـ ) والمناسبة لتحقيق النتاج ، وفي حال استخدام الإستراتيجية (6)،
            يذكر المعلم اسمها.
          </li>
        </ul>
        <p />
      </div>
      <div className="col-md-6 px-0 my-5" id="tqim">
        <p className="lead mb-0 my-5">- التقويم :</p>
        <ul className="my-3">
          <li>
            الإستراتيجية : كتابة رقم استراتيجية التقويم الواردة في صفحة ( جـ )
            والمناسبة لتحقيق النتاج ، وفي حال استخدام الإستراتيجية (6) ، يذكر
            المعلم اسمها.
          </li>
          <li>
            {" "}
            الأداة :كتابة رقم الأداة الواردة في صفحة ( جـ ) والمناسبة
            لإستراتيجية التقويم المستخدمة ، وفي حال استخدام الأداة (6) ، يذكر
            المعلم اسمها.
          </li>
        </ul>
        <p />
        <p className="lead mb-0 my-5">- التنفيذ :</p>
        <ul className="my-3">
          <li>الإجراءات :وصف لسير عملية تنفيذ أنشطة الدرس.</li>
          <li>الزمن : الفترة الزمنية المتوقعة لتنفيذ كل إجراء على حدة.</li>
        </ul>
        <p />
        <p className="lead mb-0 my-5">
          جـ. التأمل الذاتي / ( يعبأ في أثناء تنفيذ الدرس وعند الانتهاء منه ).
        </p>
        <ul className="my-3">
          <li> أشعر بالرضا عن : يسجل المعلم انطباعاته عن المواقف الإيجابية.</li>
          <li>
            {" "}
            تحديات واجهتني : يسجل المعلم الصعوبات التي تواجه عملية التنفيذ.
          </li>
          <li>
            {" "}
            اقتراحات للتحسين : يسجل المعلم ما يراه مناسباً لتحسين عملية التدريس
            وتطويرها.
          </li>
        </ul>
        <p />
        <p className="lead mb-0 my-5">د. جدول المتابعة اليومي :</p>
        <ul className="my-3">
          <li>اليوم والتاريخ : يسجل فيه يوم تنفيذ كل حصة وتاريخه.</li>
          <li>الشعبة : رمز الشعبة التي نفذت فيها الحصة.</li>
          <li>الحصة :ترتيب الحصة كما ورد في جدول الدروس الأسبوعي.</li>
          <li>النتاجات المتحققة : يكتب رقم النتاج المتحقق.</li>
          <li>الواجب البيتي : وصف الواجب البيتي وتحديده.</li>
          <li>
            إعداد المعلمين والمعلمات : كتابة اسم المعلم الذي أعد الخطة ،وفي حال
            إعدادها من قبل أكثر من معلم يتم كتابة أسمائهم.
          </li>
        </ul>
        <p />
      </div>
    </div>
  </div>
</>

    
    </>
  )
}

export default Instructions